Autodesk.Revit.DB.ScheduleFilterType
Type of schedule filter.
Since:
2013

Autodesk.Revit.DB.ScheduleFilterType.IsNotAssociatedWithGlobalParameter
The field is not associated with a specified global parameter of a compatible type

Autodesk.Revit.DB.ScheduleFilterType.IsAssociatedWithGlobalParameter
The field is associated with a specified global parameter of a compatible type

Autodesk.Revit.DB.ScheduleFilterType.NotEndsWith
For a string field, the field value does not end with the specified string.

Autodesk.Revit.DB.ScheduleFilterType.EndsWith
For a string field, the field value ends with specified string.

Autodesk.Revit.DB.ScheduleFilterType.NotBeginsWith
For a string field, the field value does not begin with the specified string.

Autodesk.Revit.DB.ScheduleFilterType.BeginsWith
For a string field, the field value begins with the specified string.

Autodesk.Revit.DB.ScheduleFilterType.NotContains
For a string field, the field value does not contain the specified string.

Autodesk.Revit.DB.ScheduleFilterType.Contains
For a string field, the field value contains the specified string.

Autodesk.Revit.DB.ScheduleFilterType.LessThanOrEqual
The field value is less than or equal to the specified value.

Autodesk.Revit.DB.ScheduleFilterType.LessThan
Less The field value is less than to the specified value.

Autodesk.Revit.DB.ScheduleFilterType.GreaterThanOrEqual
The field value is greater than or equal to the specified value.

Autodesk.Revit.DB.ScheduleFilterType.GreaterThan
The field value is greater than the specified value.

Autodesk.Revit.DB.ScheduleFilterType.NotEqual
The field value is not equal to the specified value.

Autodesk.Revit.DB.ScheduleFilterType.Equal
The field value is equal to the specified value.

Autodesk.Revit.DB.ScheduleFilterType.HasParameter
The element has the parameter specified by the field.  Used with shared parameters.  No value is specified for this filter type.

Autodesk.Revit.DB.ScheduleFilterType.Invalid
An invalid filter.  Do not use.